Repository: 84000/data-translation-memory
Catalog: toh156-v3.tmx
Source language: bo
Languages: en

source: བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་རྣམ་པར་གྲོལ་བའི་ཆོས་སྟོན་ཀྱང་རྣམ་པར་གྲོལ་བ་དེར་མི་ལྟུང་བ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་ལ་སྦྱོར་བའོ། །
en: Furthermore, Revered Subhūti, whenever a bodhisattva great being gives teachings on the liberation of the hearers and solitary buddhas without falling into that liberation themselves, this is also the proper engagement of a bodhisattva.

source: བཙུན་པ་རབ་འབྱོར་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རང་གི་ཉོན་མོངས་པ་དབེན་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་དབེན་པར་ཁོང་དུ་ཆུད་པ་དེ་ཡང་དེའི་ཚུལ་བཞིན་ལ་སྦྱོར་བའོ། །
en: Furthermore, Revered Subhūti, whenever a bodhisattva great being comprehends that because their own afflictions are void the afflictions of all beings are also void, this is also the proper engagement of a bodhisattva.

source: གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྦྱོར་བ་ལ་སྦྱོར་བ་མ་ཡིན་པ་དང་། སྦྱོར་བ་མ་ཡིན་པ་ལ་སྦྱོར་བར་མཐོང་བ་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་ལ་སྦྱོར་བའོ། །
en: Furthermore, when the engagement of a bodhisattva is seen as disengagement, and when disengagement is seen as engagement, this is also the proper engagement of a bodhisattva.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་ཀླུའི་རྒྱལ་པོའི་བུ་རྣམ་པར་འཕྲུལ་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ལ་སྦྱོར་བ་མ་ཡིན་པ་དང་། སྦྱོར་བ་མ་ཡིན་པ་ལ་སྦྱོར་བར་མཐོང་བ་ཇི་ལྟ་བུ། སྨྲས་པ།
en: Venerable Subhūti then asked the nāga prince Vikurvāṇa, “Noble son, how is a bodhisattva’s engagement seen as disengagement, and disengagement as engagement?”

source: བཙུན་པ་རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་གཉིས་སུ་མེད་པའི་ཚུལ་གྱིས་གང་མིག་དང་། གཟུགས་ནས་ཡིད་དང་ཆོས་ཀྱི་བར་དེ་དག་ནི་སྦྱོར་བ་མ་ཡིན་པར་བལྟའོ། །
en: “Revered Subhūti, from the perspective of the nonduality of the realm of phenomena, the sensory elements—from the eye and form to the mind and mental phenomena—are viewed with disengagement.

source: སྦྱོར་བ་མ་ཡིན་པ་ཞེས་བྱ་བ་ནི་ཁམས་གསུམ་དུ་ཉིང་མཚམས་མི་སྦྱོར་བ་སྟེ། དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ཀྱིས་ཉིང་མཚམས་སྦྱོར་བ་དེ་ནི་སྦྱོར་བ་ཞེས་བྱའོ། །
en: But since those who are disengaged do not take rebirth in the three realms, a bodhisattva taking rebirth through skillful means is referred to as engagement.

source: བཙུན་པ་རབ་འབྱོར་དེ་ལྟར་རབ་ཏུ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཚུལ་བཞིན་ལ་རབ་ཏུ་བརྩོན་པ་ཞེས་བྱའོ། །
en: Revered Subhūti, bodhisattvas exerting themselves in this way is what is meant by being properly diligent.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོའི་བུ་དེ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་གནང་སྟེ། སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་མཐུས་བྱང་ཆུབ་སེམས་དཔའི་ཚུལ་བཞིན་ལ་སྦྱོར་བ་འདི་དེ་ལྟར་བསྟན་པ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: The Blessed One gave his approval to the nāga prince, saying, “Holy being, the teaching on the proper engagement of bodhisattvas that you just gave through the power of the Buddha is excellent, excellent!

source: བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཐེག་པ་ཆེན་པོ་འདི་ལ་ཚུལ་བཞིན་དེ་ལྟ་བུ་ལ་རབ་ཏུ་བརྩོན་པ་དེ་དག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པ་ཡིན་པར་བལྟའོ། །
en: Consider it certain that bodhisattvas who are properly diligent in the Great Vehicle in this way will reach omniscience itself.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཀླུའི་རྒྱལ་པོའི་བུ་རྣམ་པར་འཕྲུལ་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཟང་ཟིང་མ་མཆིས་པའི་སེམས་ཀྱིས་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་སྐྱབས་སུ་མཆིས་པ་ལགས། བཀའ་སྩལ་པ།
en: Then the nāga prince Vikurvāṇa asked the Blessed One, “Blessed One, how does a bodhisattva great being take refuge in the Buddha, the Dharma, and the Saṅgha without regard for material things?”

source: རིགས་ཀྱི་བུ་གང་གི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཐམས་ཅད་བདག་མེད་པ་དང་། སེམས་ཅན་མེད་པ་དང་། སྲོག་མེད་པ་དང་། གང་ཟག་མེད་པར་ཤེས་ནས་གཟུགས་སུ་མ་ཡིན། མཚན་དུ་མ་ཡིན།
en: “Noble son, bodhisattvas understand that all phenomena are devoid of a self, a being, a life force, and a person, and they correctly see that the Thus-Gone One is not his form, marks, or qualities.

source: ཆོས་སུ་མ་ཡིན་པར་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དེ་ལྟ་བུ་ནི་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་སངས་རྒྱས་ལ་སྐྱབས་སུ་སོང་བ་ཡིན་ནོ། །
en: This is how they take refuge in the Buddha without regard for material things.

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ནི་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་གང་ཡིན་པ་དེ་ནི་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་སྟེ།
en: “The true nature of a thus-gone one is the realm of phenomena, and the realm of phenomena is said to cover all there is.

source: དེ་ལྟར་ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རྗེས་སུ་སོང་བར་མཐོང་བ་དེ་ལྟ་བུ་ནི་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་ཆོས་ལ་སྐྱབས་སུ་སོང་བ་ཡིན་ནོ། །
en: Seeing that all phenomena are the realm of phenomena, bodhisattvas take refuge in the Dharma without regard for material things.

source: གང་ཆོས་ཀྱི་དབྱིངས་འདུས་མ་བྱས་པར་རབ་ཏུ་བསྒོམ་པ་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པ་ལ་འདུས་མ་བྱས་པ་སྟོན་པ་དང་།
en: “By meditating on the unconditioned nature of the realm of phenomena and teaching the unconditioned to followers of the hearer vehicle, they make no distinction between the conditioned and the unconditioned.

source: འདུས་བྱས་དང་། འདུས་མ་བྱས་གཉིས་སུ་མེད་པ་འདི་ལྟ་བུ་ནི་ཟང་ཟིང་མེད་པའི་སེམས་ཀྱིས་དགེ་འདུན་ལ་སྐྱབས་སུ་སོང་བ་ཡིན་ནོ། །
en: In this way they take refuge in the Saṅgha without regard for material things.”

source: བསྟན་པ་འདི་བཤད་པའི་ཚེ་ཀླུའི་རྒྱལ་པོའི་བུ་རྣམ་པར་འཕྲུལ་པས་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ཆུང་མའི་འཁོར་དང་བཅས།
en: When this teaching was given, the nāga king’s son Vikurvāṇa reached concordant acceptance of phenomena.

source: བུ་དང་བཅས། གཉེན་དང་འཁོར་དུ་བཅས་ཏེ། དངོས་པོ་ཐམས་ཅད་ཀྱིས་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་སྐྱབས་སུ་སོང་ནས་རང་གི་གནས་བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་བཅས་པ་ལ་ཕུལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, together with his retinue of wives, sons, and relatives, the nāga king Anavatapta took refuge in the Buddha, the Dharma, and the Saṅgha with all his goods.

source: བཅོམ་ལྡན་འདས་བདག་སྨོན་ལམ་འདེབས་པ་ནི་འདི་ལགས་ཏེ། གང་བདག་གི་གནས་འདི་ནས་ཀླུང་ཆེན་པོ་བཞི་འབབ་པ་རྒྱ་མཚོ་ཆེན་པོ་བཞིར་འབབ་པའི་རྒྱ་མཚོ་ཆེན་པོ་དེ་དག་དང་།
en: He offered his kingdom to the Blessed One and his assembly of monks, saying, “Blessed One, this is my prayer: In my kingdom, there are four great rivers, which flow into the four great oceans.

source: བཅོམ་ལྡན་འདས་ཀླུང་ཆེན་པོ་འདི་དག་ལ་འཚལ་བའི་སེམས་ཅན་རྐང་གཉིས་པ་དང་། རྐང་བཞི་པ་དང་། རྐང་མངས་དང་། རི་དགས་དང་། བྱ་གང་ལགས་པ་དེ་དག་རྒྱུ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་གྱུར་ཅིག །
en: Blessed One, through this act, may all beings—those with two legs, four legs, and many legs, and all the other animals and birds who feed in the great oceans and rivers, reach unsurpassed, perfect awakening.

source: གང་དག་བྱང་ཆུབ་ཏུ་སྨོན་པ་དེ་དག་ཀྱང་རྒྱུ་དེས་རྣམ་པར་གྲོལ་བར་གྱུར་ཅིག །
en: Through this act, may all those who aspire to reach awakening be liberated!”

source: དེ་ནས་དེའི་ཚེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་འཛུམ་པ་མཛད་དོ། །འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་གང་གི་ཚེ་འཛུམ་པ་མཛད་པའི་ཆོས་ཉིད་དེ། དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་ཁ་དོག་དུ་མའི་འོད་ཟེར་བྱུང་ནས་མཐའ་ཡས་མུ་མེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཀྱིས་ཁྱབ་པར་བྱས་ཏེ།
en: At that moment, the Blessed One smiled, and as is the case when blessed buddhas smile, multicolored light rays shined forth from the Blessed One’s mouth and illuminated countless world systems.

source: སླར་ལོག་ནས་དེ་བཞིན་གཤེགས་པའི་དབུའི་གཙུག་ཏུ་ནུབ་བོ། །
en: Those light rays then returned, and they vanished into the crown of the Thus-Gone One’s head.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། །མཚུངས་པ་མ་མཆིས་གཟུགས་མངའ་མཐོང་ན་དགའ། །
en: Venerable Ānanda then offered these verses to the Blessed One: “Peerless one, your form is a delight to behold.

source: སྐྱེས་མཆོག་བཅོམ་ལྡན་སྐྱེས་བུ་ཁྱུ་མཆོག་པ། །འཇིག་རྟེན་འདས་ལ་འཇིག་རྟེན་སྒྲོན་མ་ཡི། །
en: Supreme being, Blessed One, foremost among men, Though you transcend the world, you are the lamp that illuminates it.

source: འོད་གཟི་བཞད་པའི་དོན་འདི་བདག་ལ་གསུངས། །
en: Sage, please tell us the reason for your radiant smile.

source: བསོད་ནམས་བརྒྱ་མངའ་བསོད་ནམས་ལྷག་པ་པོ། །ཡེ་ཤེས་ཀྱིས་འཕགས་ཡེ་ཤེས་སྣང་མཛད་པ། །
en: “Endowed with hundreds of merits and even more, Distinguished by your wisdom, you clarify the meaning of that wisdom.

source: ཆོས་དབང་མི་མཚུངས་ཆོས་ཀྱི་བཀའ་མཆིད་ཅན། །
en: The power of your Dharma is unmatched, and you grant us Dharma discourses.

source: བཅོམ་ལྡན་ཅི་ཡི་དོན་དུ་བཞད་པ་སྟོན། །
en: Blessed One, why do you smile?

source: བདེན་པ་གཟིགས་ཤིང་རྟག་ཏུ་བདེན་ལ་དགྱེས། །
en: “You see the truth, and you always delight in truth.

source: དབང་པོ་ཞི་བ་ཞི་གནས་ཕ་རོལ་ཕྱིན། །
en: Your senses are at peace, you abide in tranquility, and you have reached perfection.

source: ཞི་ལ་རབ་ཞི་ཞི་གནས་དགྱེས་པ་པོ། །
en: Utterly calm, you delight in peaceful abiding.

source: བཞད་དོན་ཡོན་ཏན་མཐར་ཕྱིན་བདག་ལ་གསུངས། །
en: Please explain to us the perfect qualities of your smile.

source: འཇམ་པའི་གསུང་ཅན་ཚངས་པའི་དབྱངས་འབྱིན་པ། །བྱ་མཆོག་མང་པོའི་སྒྲ་དང་སིལ་སྙན་སྒྲ། །སྒྲ་དབྱངས་ཡན་ལག་ཐམས་ཅད་རྫོགས་པའི་དབྱངས། །ཐུབ་པ་བཞད་པར་སྦྱོར་བ་བདག་ལ་གསུངས། །
en: “With your voice as sweet as the voice of Brahmā, Sweet as the chirping of excellent birds or the sound of music, With all aspects of tunefulness and melody, Sage, please tell us the reason for your smile.

source: ཐུབ་པ་ཤེས་རབ་འབྱུང་གནས་ཤེས་རབ་གྲོལ། །
en: “Sage, you are the source of insight, and your insight is liberated.

source: རྟག་ཏུ་མཉམ་གཞག་འཁྲུལ་པའི་ཐུགས་མི་མངའ། །ཐམས་ཅད་མཁྱེན་པ་སེམས་ཅན་སྤྱོད་ལ་མཁས། །
en: Constantly settled in equipoise with a mind devoid of confusion, You are omniscient, expert in the ways of beings.

source: མཚུངས་མེད་བཞད་པའི་དོན་ནི་ལེགས་པར་གསུངས། །
en: Peerless One, please tell us the reason for your smile.

source: ཡེ་ཤེས་མི་ཕྱེད་དབང་གི་མཐར་ཕྱིན་པ། །རྫུ་འཕྲུལ་མཐའ་ཡས་པ་ཡི་སྟོབས་སྟོན་ཅིང་། །
en: “Your wisdom unswerving, your power complete, You display countless miraculous powers.

source: སྟོབས་བཅུ་མངའ་བ་དབང་གི་ཕ་རོལ་གཤེགས། །
en: You possess the ten powers, and your mastery is perfect.

source: བདེ་བར་གཤེགས་ཁྱོད་ཅི་སླད་འདིར་འཛུམ་སྟོན། །
en: Well-Gone One, why do you smile?

source: སྐུ་འོད་དཔལ་གྱིས་སྣང་བ་མཛད་པ་པོ། །ཁྱོད་ཀྱི་འོད་ཀྱིས་གཞན་འོད་གསལ་མི་འགྱུར། །
en: “Your body radiates glorious light That outshines the light of others.

source: ཇི་ལྟར་རྒྱལ་བའི་འོད་ནི་མངའ་བ་ལྟར། །ཉི་ཟླ་ཞུགས་དང་ནོར་བུའི་མ་ལགས་སོ། །
en: Nothing shines like the light of the Victor— Neither the sun nor the moon, neither fire nor precious gems.

source: བསོད་ནམས་ཆེན་པོ་ཐེ་ཙོམ་མི་མངའ་བ། །
en: “Meritorious one, you are free of doubt.

source: རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་གསལ་མཛད། །
en: Perfect bodhisattva, you illuminate all directions.

source: བཅོམ་ལྡན་ཅི་སླད་བཞད་པ་སྟོན་པ་དེ། །
en: Blessed One, why do you smile?

source: མི་མཚུངས་ཡེ་ཤེས་མངའ་བས་བདག་ལུང་སྟོན། །
en: Peerless one, please instruct us through your wisdom!”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀུན་དགའ་བོ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དེ་བཞིན་གཤེགས་པ་ལ་འདི་འདྲ་བའི་བཀོད་པ་འདི་དག་གིས་མཆོད་པ་བྱེད་པ་མཐོང་ངམ། གསོལ་པ།
en: Then the Blessed One said to Venerable Ānanda, “Ānanda, did you see the array of offerings that the nāga king Anavatapta presented to the Thus-Gone One?”

source: བཅོམ་ལྡན་འདས་མཐོང་ལགས་སོ། །
en: “Yes, Blessed One, I did.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་འདིས་བྱང་ཆུབ་བསྒྲུབ་པའི་ཕྱིར་སངས་རྒྱས་བྱེ་བ་ཕྲག་དགུ་བཅུ་རྩ་དགུའི་གན་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་དོ། །
en: The Blessed One continued, “In order to attain awakening, the nāga king Anavatapta has formerly practiced the holy life in the presence of nine hundred ninety million buddhas.

source: གང་གི་ཚེ་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཀྱིས་ང་ལ་ཁྱོད་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ། །ཞེས་ལུང་བསྟན་པ་དེའི་ཚེ་དེའི་དུས་ན་ཀླུའི་རྒྱལ་པོ་འདི་ཚོང་དཔོན་གྱི་བུ་རྣམ་པར་དག་པའི་བློ་གྲོས་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: When the Thus-Gone Dīpaṃkara prophesied to me, ‘In the future, you will be the thus-gone, worthy, perfect buddha named Śākyamuni,’ this nāga king was a merchant’s son named Viśuddhamati.

source: དེས་ང་ལུང་བསྟན་པ་ཐོས་ནས་སྨོན་ལམ་བཏབ་པ། བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་ཇི་ལྟར་ཁྱེའུ་བློ་གྲོས་བཟང་པོ་འདི་ལུང་བསྟན་པ་བཞིན་དུ་ལུང་སྟོན་པར་གྱུར་ཅིག་ཅེས་སྨྲས་སོ། །
en: When he heard my prophecy, he made this prayer: ‘In the future, may I, too, receive a prophecy like the one this boy Sumati has received.’

source: ཀུན་དགའ་བོ་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་འདི་ཇི་ལྟར་ད་ལྟར་ང་ལ་འབུལ་བ་དེ་བཞིན་དུ་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་ཡང་རང་གི་གནས་བརྒྱན་ནས་འབུལ་བར་འགྱུར་ཏེ།
en: “Ānanda, just as the nāga king Anavatapta makes offerings to me now, so, too, will he offer his kingdom and its adornments to all the thus-gone ones of the Fortunate Eon.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་དེའི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་རྣམ་པར་དག་པའི་ལམ་གྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆད་པར་འགྱུར་རོ། །ས་ཕྱོགས་འདི་ཉིད་དུ་དེ་བཞིན་གཤེགས་པ་ལོག་པར་དད་སེལ་དང་། གསེར་ཐུབ་དང་། འོད་སྲུང་ཡང་བཞུགས་ནས་རྣམ་པར་དག་པའི་ལམ་གྱི་ཆོས་ཀྱི་སྒོའི་ལེའུ་འདི་གསུངས་སོ། །
en: Understanding his pure motivation, all the thus-gone ones will teach him this Dharma teaching on the pure path, and the thus-gone ones Krakucchanda, Kanakamuni, and Kāśyapa have also taught this teaching on the Dharma gateway of the pure path while residing in this place.

source: ཀླུའི་བདག་པོ་མ་དྲོས་པ་འདི་བསྐལ་པ་བཟང་པོའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་པ་བྱེད་པར་འགྱུར་རོ། །
en: The lord of nāgas Anavatapta will make offerings to all the thus-gone ones of the Fortunate Eon.

source: ཆོས་ཀྱང་ཉན་པར་འགྱུར་རོ། །དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་གྲངས་མེད་པ་མཉེས་པར་བྱེད་པར་འགྱུར། ཚངས་པར་སྤྱད་པ་ཡང་སྤྱོད་པར་འགྱུར། དམ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་འཛིན་པར་འགྱུར་ཏེ།
en: He will listen to the Dharma from them, and henceforth he will please countless thus-gone ones, practice the holy life, and maintain the sacred Dharma.

source: བསྐལ་པ་གྲངས་མེད་པ་བདུན་སྟོང་ལྔ་བརྒྱ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་དྲོས་པ་ཞེས་བྱ་བ་ཉིད་དུ་འགྱུར་རོ། །
en: After seven thousand five hundred incalculable eons, he will become the thus-gone, worthy, perfect buddha named Anavatapta.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མ་དྲོས་པ་བྱང་ཆུབ་ཐོབ་པའི་ཚེ་སེམས་ཅན་གང་ཡང་འདོད་ཆགས་ཀྱི་གདུང་བའམ། ཞེ་སྡང་གི་གདུང་བའམ། གཏི་མུག་གི་གདུང་བའམ། ཕ་རོལ་གྱི་གདུང་བས་གདུང་བར་མི་འགྱུར་ཏེ། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་ངེས་པར་ཚེའི་ཚད་དུ་འགྱུར་རོ། །
en: Ānanda, when the Thus-Gone Anavatapta attains awakening, beings will no longer be afflicted by desire, aversion, or delusion, nor will they be tormented by opponents, and all beings will be secure and live out their full lifespans.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མ་དྲོས་པའི་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུར་འགྱུར་རོ། །
en: Ānanda, the lifespan of the Thus-Gone Anavatapta will be eight hundred million years.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མ་དྲོས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ནི་བཻ་ཌཱུརྱ་ལས་གྲུབ་པར་འགྱུར་ཏེ། ས་ཆེན་པོ་དེ་ནི་འཛམ་བུའི་གླིང་གི་གསེར་གྱི་པད་མས་ཁེབས་པར་འགྱུར།
en: “Ānanda, the buddha field of the Thus-Gone Anavatapta will be made from beryl, and its land will be covered with lotuses made of gold from the Jambū River.

source: ལྷ་དང་མི་དེ་དག་གི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱད་པ་དང་། བཟའ་བ་དང་། བཏུང་བ་ཡང་བསམས་པ་ཙམ་གྱིས་འབྱོར་བར་འགྱུར།
en: There, the luxuries, pleasures, foods, and drinks of gods and humans will be available by merely thinking of them.

source: མི་དེ་དག་ཐམས་ཅད་མངོན་པར་ཤེས་པ་ལྔས་ནམ་མཁའ་ལ་འགྲོ་བར་འགྱུར།
en: All humans living there will fly through the sky by the power of the five higher perceptions.

source: དགའ་ལྡན་གྱི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པ་ཅི་འདྲ་བར་མི་དེ་དག་གི་ཡང་དེ་འདྲ་བར་འགྱུར་རོ། །
en: The luxuries and pleasures of those humans will be like those of the gods in the Heaven of Joy.

source: སེམས་ཅན་དེ་དག་གཉིས་ཀྱིས་གཉིས་སྦྱོར་བ་མ་ཡིན་གྱི། དེ་དག་ཐམས་ཅད་ཆོས་ཀྱི་དགའ་བ་ལ་དགའ་ཞིང་མོས་པར་འགྱུར། ཉོན་མོངས་པ་རྣམས་ཀྱང་རབ་ཏུ་ཞི་བར་འགྱུར་རོ། །
en: Those beings will not engage in sexual acts; instead, they will all enjoy and aspire to the joy of the Dharma, and their afflictions will be pacified.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཡང་ཡོངས་སུ་མི་སྐྱོ་བར་ཆོས་སྟོན་པར་འགྱུར་རོ། །
en: “That thus-gone one will tirelessly teach the Dharma.

source: ཇི་ལྟར་ད་ལྟར་ང་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་ཐམས་ཅད་ཀྱིས་ཆོས་སྟོན་པ་ལྟར་དེ་ཤ་ཐང་བར་ཆོས་སྟོན་པར་མི་འགྱུར་རོ། །
en: Just as I now teach the Dharma using all kinds of miraculous displays, he, too, will have no difficulty teaching the Dharma.

source: སེམས་ཅན་དེ་དག་ཀྱང་ཆོས་བརྗོད་པ་ཙམ་གྱིས་འདུལ་བར་འགྱུར་རོ། །
en: He will tame beings by merely speaking the Dharma.

source: ས་འདི་ལྟར་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ལྷ་དང་མི་རྣམས་ལ་ཆོས་ཀྱི་གཏམ་གཅིག་སྟོན་པར་འགྱུར་བའི་ཕྱིར་རོ། །
en: Because the same Dharma discourse taught here will be taught to both the gods and the humans in that buddha field.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉིན་མཚན་ཞེས་སོ་སོར་བགྲང་དུ་མེད་པར་འགྱུར།
en: In that buddha field, there will be no distinction between day and night.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མ་དྲོས་པ་དེའི་རང་གི་ལུས་ལས་འོད་བཀྱེ་བས་ཐམས་ཅད་དང་ལྡན་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་གསལ་བས་ཁྱབ་པར་འགྱུར་རོ། །
en: Because, Ānanda, that entire buddha field will be illuminated by light radiating from the body of the Thus-Gone Anavatapta.

source: དེ་ནས་སེམས་ཅན་དེ་དག་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་བཀའ་མཆིད་མཛད་པར་འགྱུར་རོ་སྙམ་དུ་སེམས་པར་འགྱུར་ཞིང་དེ་དག་འོད་དེས་བསྐུལ་བ་དང་། ཆོས་ཉན་པའི་ཕྱིར་ནམ་མཁའ་ལས་འདོང་བར་འགྱུར་རོ། །
en: Those beings will then think, ‘The Thus-Gone One is going to give a Dharma discourse,’ and, inspired by that light, they will come down from the sky to listen to the Dharma.

source: དེ་ལྟར་དེ་དག་འདུས་ནས་དེ་བཞིན་གཤེགས་པ་དེ་ཤིང་ཏ་ལ་བདུན་སྲིད་དུ། སྟེང་གི་བར་སྣང་ལ་འཕགས་ཏེ།
en: Once they have gathered, the Thus-Gone One will rise up in the sky to a height of seven palm trees.

source: ནམ་མཁའ་ལ་གནས་པའི་སེང་གེའི་ཁྲི་ལ་འདུག་ནས། སེམས་ཅན་དེ་དག་ལ་ཆོས་སྟོན་པར་འགྱུར་རོ། །
en: There, he will sit on a lion throne and teach them the Dharma.

source: དེ་དེར་འདུག་པ་དང་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཐམས་ཅད་དུ་སྣང་བར་འགྱུར་ཏེ། དཔེར་ན་ཟླ་བ་ཉ་བའི་དཀྱིལ་འཁོར་བཞིན་ནོ། །
en: While sitting there, he will be visible throughout the entire buddha field, like the disk of the full moon.

source: དེ་ན་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པའི་སེམས་ཅན་དེ་དག་འདི་སྙམ་དུ་ཇི་ལྟར་བཅོམ་ལྡན་འདས་དེའི་སེང་གེའི་ཁྲི་གནས་མེད་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་གནས་མེད་དེ་ནམ་མཁའི་ངོ་བོ་ཉིད་དོ་སྙམ་དུ་སེམས་པར་འགྱུར་ཏེ།
en: “Then those beings endowed with ripened roots of virtue will think, ‘Just as the Blessed One’s lion throne is groundless, so, too, are all phenomena—their essential nature is groundless space.’

source: དེ་དག་དེ་ཉིད་ཀྱིས་མངོན་པར་རྟོགས་པར་འགྱུར། བཟོད་པ་ཡང་རབ་ཏུ་འཐོབ་པར་འགྱུར་རོ། །
en: With that thought, those beings will become realized and reach acceptance.

source: དེ་བཞིན་གཤེགས་པ་དེ་ནི་རྡོ་རྗེའི་སྒོ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་སྟོན་ཏོ། །འདི་ལྟ་སྟེ།
en: That thus-gone one will teach the Dharma discourse called Entering the Vajra Gateway.

source: དཔེར་ན་རྡོ་རྗེ་ནི་གང་དང་གང་དུ་བབ་པ་དེ་དང་དེ་དག་འཇོམས་སོ། །དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པ་དེའི་ཆོས་བསྟན་པ་ཡང་བག་ལ་ཉལ་དང་ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་འཇོམས་སོ། །
en: Just as a vajra destroys everything it falls upon, the Dharma teaching of this thus-gone one will destroy all latent and deeply ingrained tendencies.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པ་མ་དྲོས་པ་དེ་གང་གི་ཚེ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་ཁྱད་པར་འཕགས་ཞེས་བྱ་བ་འདི་ངའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་ཀུན་དུ་སྣང་བ་ཞེས་བྱ་བར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་ཡང་འདི་འདྲ་བ་ཉིད་དུ་འགྱུར་རོ། །
en: “Ānanda, when the Thus-Gone Anavatapta is about to pass into parinirvāṇa, he will prophesy, ‘After I pass away, the bodhisattva Lofty Aspiration will become the Thus-Gone Samantaprabhāsa, and his buddha field will just like this.’

source: ཞེས་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་ཁྱད་པར་འཕགས་པ་ལུང་བསྟན་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ། །
en: After uttering this prophecy about the bodhisattva Lofty Aspiration, he will pass into parinirvāṇa.”

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པའི་བུ་རྟག་ཏུ་དད་པ་ཐོབ་ཅེས་བྱ་བ་དེས་ནོར་བུ་རིན་པོ་ཆེའི་གདུགས་རིན་པོ་ཆེས་སྤྲས་པ་དེ་བཞིན་གཤེགས་པ་ལ་ཕུལ་ལོ། །ཕུལ་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་ཁྱད་པར་འཕགས་ཞེས་བགྱི་བར་འགྱུར་བ་དེ་གང་ལགས།
en: The son of the nāga king Anavatapta named Attainment of Perpetual Faith then offered a parasol adorned with precious gems to the Thus-Gone One and said, “Blessed One, at that time, who will be that bodhisattva named Lofty Aspiration?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་རྒྱལ་པོའི་བུ་རྟག་ཏུ་དད་པ་ཐོབ་ཀྱི་ལྷག་པའི་བསམ་པ་མཁྱེན་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་ཁྱད་པར་འཕགས་ཞེས་བྱ་བར་འགྱུར་བ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་ཁྱོད་སེམས་ན་དེ་ལྟར་མི་བལྟའོ། །
en: Knowing the superior motivation of the nāga prince Attainment of Perpetual Faith, the Blessed One said to Venerable Ānanda, “Ānanda, at that time, this son of the nāga king Attainment of Perpetual Faith will be that bodhisattva named Lofty Aspiration.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀུན་དགའ་བོ་ཀླུའི་རྒྱལ་པོའི་བུ་རྟག་ཏུ་དད་པ་ཐོབ་པ་འདི་ཉིད་དེའི་ཚེ་དེའི་ཚེ་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་ཁྱད་པར་འཕགས་ཞེས་བྱ་བར་འགྱུར་ཏེ།
en: Do not consider him as any other.

source: བཅོམ་ལྡན་འདས་མ་དྲོས་པ་དེའི་འོག་ཏུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀུན་དུ་སྣང་བ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་ངོ་། །
en: After the Blessed Anavatapta, he will appear in the world as the thus-gone, worthy, perfect buddha named Samantaprabhāsa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཞུས་པ་ལུང་བསྟན་ཅིང་རྣམ་པར་དག་པའི་ལམ་གྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མཐར་ཕྱིན་པའི་དུས་ཤེས་ནས་ཕྱོགས་བཅུ་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: After the Blessed One had answered these questions, and when it was understood that this Dharma teaching on the pure path was complete, the bodhisattva great beings, in addition to Śakra, Brahmā, the protectors of the world, and the gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who had assembled from the ten directions, were satisfied, pleased, delighted, and overjoyed.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཤིང་རབ་ཏུ་དགའ་སྟེ། དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་མངོན་པར་དགའ་སྟེ་སྟན་ལས་ལངས་ནས། བཅོམ་ལྡན་འདས་ལ་ཚུལ་བཞིན་དུ་མཆོད་དེ། རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དང་རང་རང་གི་གནས་སུ་དོང་ངོ་། །
en: Full of joy and happiness, they rose from their seats cheerfully, made offerings to the Blessed One in the appropriate manner, and returned to their respective buddha fields and residences.

source: དེ་ནས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་བུ་དང་བཅས། ཆུང་མ་དང་བཅས། གཉེན་དང་འཁོར་དུ་བཅས་ཏེ་ཀླུའི་རྒྱལ་པོ་ལྷ་སྲུང་དུ་མངོན་པར་སྤྲུལ་ནས་བཅོམ་ལྡན་འདས་ཀྱི་གཞལ་མེད་ཁང་རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་ཡང་མངོན་པར་སྤྲུལ་ཏེ།
en: Then the nāga king Anavatapta, accompanied by his sons, wives, relatives, and retinue, manifested himself as the nāga king Guardian God and conjured a celestial palace for the Blessed One adorned with all the most exquisite features.

source: བཅོམ་ལྡན་འདས་དེར་བཞུགས་སུ་གསོལ་ནས། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་བཅས། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་བཀོད་དེ་རང་གི་གནས་ནས་བྱུང་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་འབྲིང་དུ་སོང་སྟེ།
en: He requested the Blessed One to reside there along with his assembly of bodhisattvas and his assembly of hearers, and he emerged from his home to serve him.

source: དེས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དང་བཅས། ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་བྱ་རྒོད་ཕུང་པོའི་རི་ལ་བསྐྱལ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་གནང་སྟེ་རང་གི་གནས་སུ་སོང་ངོ་། །
en: He then escorted the Blessed One, along with the bodhisattvas and his saṅgha of hearers, back to Vulture Peak Mountain, and after the Blessed One had given him leave, he returned home.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །གསོལ་པ།
en: The Blessed One then said to Venerable Ānanda, “Ānanda, you must remember this Dharma teaching.”

source: བདག་གིས་གཟུང་ལགས་སོ། །
en: “I will remember it!”
